In [1]:
import pandas as pd                       #### Created by PRITHVIRAJ REDDY, 14-06-2021  ####
import numpy as np
import warnings
warnings.filterwarnings('ignore')
ds = pd.Series([2,3,4,56.77])
print(ds)

0     2.00
1     3.00
2     4.00
3    56.77
dtype: float64

# Series

In [2]:
ds2 = pd.Series([2,3,4,5,66],dtype=float)
print(ds2)

0     2.0
1     3.0
2     4.0
3     5.0
4    66.0
dtype: float64

In [3]:
series_to_list = pd.Series([2,3,5,67,9,88])
print(series_to_list)
print("type of data : " ,type(series_to_list))

0     2
1     3
2     5
3    67
4     9
5    88
dtype: int64
type of data :  <class 'pandas.core.series.Series'>

In [4]:
 series_to_list = series_to_list.tolist()

In [5]:
print(series_to_list)
print("type of data : " ,type(series_to_list))

[2, 3, 5, 67, 9, 88]
type of data :  <class 'list'>

In [6]:
series = pd.Series([3,4,5,7,8])
print(series)

0    3
1    4
2    5
3    7
4    8
dtype: int64

In [7]:
print(list(series))

[3, 4, 5, 7, 8]

In [8]:
print(type(list(series)))

<class 'list'>

In [9]:
ser1 = pd.Series([2, 4, 6, 8, 10])
ser2 = pd.Series([1, 3, 5, 7, 9])

In [10]:
add = ser1 + ser2

In [11]:
print(" Addition of ser1 and ser2 is:")
print(add)

 Addition of ser1 and ser2 is:
0     3
1     7
2    11
3    15
4    19
dtype: int64

In [12]:
sub = ser1 - ser2

In [13]:
print("Subtraction of ser1 and ser2 : ")
print(sub)

Subtraction of ser1 and ser2 :
0    1
1    1
2    1
3    1
4    1
dtype: int64

In [14]:
mul = ser1 * ser2

In [15]:
print("Multiplication of ser1 and ser2 : ")
print(mul)

Multiplication of ser1 and ser2 :
0     2
1    12
2    30
3    56
4    90
dtype: int64

In [16]:
div = ser1/ser2

In [17]:
print("Division of ser1,ser2 : ")
print(div)

Division of ser1,ser2 :
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [18]:
profile = pd.Series([14,"tony",999999999,"India"])

In [19]:
print(profile)

0           14
1         tony
2    999999999
3        India
dtype: object

In [20]:
import pandas as pd
import numpy as np
ser1 = pd.Series([2, 4, 6, 8, 10])
ser2 = pd.Series([1, 3, 5, 7, 9])
print("add two series : \n" ,ser1.add(ser2))
print("-----------------------------------")
print("sub two series : \n" ,ser1.sub(ser2))
print("-----------------------------------")
print("mul two series : \n" ,ser1.mul(ser2))
print("-----------------------------------")
print("div two series : \n" ,ser1.div(ser2))

add two series :
 0     3
1     7
2    11
3    15
4    19
dtype: int64
-----------------------------------
sub two series :
 0    1
1    1
2    1
3    1
4    1
dtype: int64
-----------------------------------
mul two series :
 0     2
1    12
2    30
3    56
4    90
dtype: int64
-----------------------------------
div two series :
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [21]:
comp1 = pd.Series([2, 4, 6, 8, 10])
comp2 = pd.Series([1, 3, 5, 7, 10])

In [22]:
print(comp1)
print("---------------")
print(comp2)

0     2
1     4
2     6
3     8
4    10
dtype: int64
---------------
0     1
1     3
2     5
3     7
4    10
dtype: int64

In [23]:
print("Equals")
print(comp1==comp2)
print("---------------------------")
print("Not equals")
print(comp1!=comp2)
print("---------------------------")
print("Greater than")
print(comp1>comp2)
print("---------------------------")
print("less than")
print(comp1<comp2)

Equals
0    False
1    False
2    False
3    False
4     True
dtype: bool
---------------------------
Not equals
0     True
1     True
2     True
3     True
4    False
dtype: bool
---------------------------
Greater than
0     True
1     True
2     True
3     True
4    False
dtype: bool
---------------------------
less than
0    False
1    False
2    False
3    False
4    False
dtype: bool

In [24]:
dic = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
print(type(dic))

<class 'dict'>

In [25]:
see = pd.Series(dic)
print(see)
print("----------------------")
print(type(see))

a    100
b    200
c    300
d    400
e    800
dtype: int64
----------------------
<class 'pandas.core.series.Series'>

In [26]:
import pandas as pd
import numpy as np

In [27]:
numpp = np.array([10 ,20, 30, 40, 50])

In [28]:
print(type(numpp))

<class 'numpy.ndarray'>

In [29]:
num_to_ser = pd.Series(numpp)

In [30]:
print(num_to_ser)
print(type(num_to_ser))

0    10
1    20
2    30
3    40
4    50
dtype: int32
<class 'pandas.core.series.Series'>

In [31]:
change = pd.Series([100,200,"python",300.12,400])

In [32]:
print(change)
print("--------------------")
print(type(change))

0       100
1       200
2    python
3    300.12
4       400
dtype: object
--------------------
<class 'pandas.core.series.Series'>

In [33]:
Afterchange = pd.to_numeric(change,errors="coerce")

In [34]:
print(Afterchange)
print("----------------")
print(type(Afterchange))

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64
----------------
<class 'pandas.core.series.Series'>

#  Write a Pandas program to convert the first column of a DataFrame as a Series

In [35]:
dict2 = {'col1' : [1,2,3,4,5,6],
'col2' : [7,8,9,10,11,12],
'col3' : [13,14,15,16,17,18]}
df_col = pd.DataFrame(data=dict2)
df_col

   col1  col2  col3
0     1     7    13
1     2     8    14
2     3     9    15
3     4    10    16
4     5    11    17
5     6    12    18

In [36]:
print(type(df_col))

<class 'pandas.core.frame.DataFrame'>

In [37]:
ss = df_col.col1

In [38]:
df_col2 = pd.Series(ss)

In [39]:
print(df_col2)
print("-------------------")
print(type(df_col2))

0    1
1    2
2    3
3    4
4    5
5    6
Name: col1, dtype: int64
-------------------
<class 'pandas.core.series.Series'>

# Write a Pandas program to convert a given Series to an array

In [40]:
import pandas as pd
import numpy as np
series2 = pd.Series([100,200,"python",300.12,400])
print(series2)
print("---------------------")
print(type(series2))

0       100
1       200
2    python
3    300.12
4       400
dtype: object
---------------------
<class 'pandas.core.series.Series'>

In [41]:
toarray = np.array(series2)
print(toarray)
print("---------------------")
print(type(toarray))

[100 200 'python' 300.12 400]
---------------------
<class 'numpy.ndarray'>

In [42]:
tolist = np.array(series2.values.tolist())
print(tolist)
print("---------------------")
print(type(tolist))

['100' '200' 'python' '300.12' '400']
---------------------
<class 'numpy.ndarray'>

# Write a Pandas program to convert Series of lists to one Series

In [43]:
colour = pd.Series([['Red', 'Green', 'White'],['Red', 'Black'],['Yellow']])
print(colour)
print(type(colour))

0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
<class 'pandas.core.series.Series'>

In [44]:
colour  = colour.apply(pd.Series).stack().reset_index(drop=True)

In [45]:
print(colour)
print("------------------")
print(type(colour))

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object
------------------
<class 'pandas.core.series.Series'>

In [46]:
colour = colour.apply(pd.Series).stack().reset_index(drop=True)

In [47]:
colour

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [48]:
series_1 = pd.Series(["Red","Green","White"])
series_2 = pd.Series(["Red","Black"])
series_3 = pd.Series(["Yellow"])

In [49]:
combined_series = pd.concat([series_1,series_2,series_3])
#combined_series.reset_index(drop=True)

In [50]:
combined_series

0       Red
1     Green
2     White
0       Red
1     Black
0    Yellow
dtype: object

In [51]:
combined_series.reset_index()

   index       0
0      0     Red
1      1   Green
2      2   White
3      0     Red
4      1   Black
5      0  Yellow

In [52]:
combined_series.reset_index(drop=True)

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [53]:
s = pd.Series([['Red', 'Green', 'White'], ['Red', 'Black'], ['Yellow']])
combinedData = pd.Series([val for sublist in s for val in sublist])
print(combinedData )

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

# Write a Pandas program to sort a given Series

In [54]:
sort_se = pd.Series(["100","200","python","300.12","400"],dtype=object)
print(sort_se)

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [55]:
sort_series = pd.Series(sort_se).sort_values()
print(sort_series)

0       100
1       200
3    300.12
4       400
2    python
dtype: object

# Write a Pandas program to add some data to an existing Series

In [56]:
add_se = pd.Series([100,200,"python",300.12,400])
print(add_se)

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [57]:
new_added = add_se.append(pd.Series([500,"php"]))
print(new_added)

0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

# Write a Pandas program to create a subset of a given series based on value and condition.

In [58]:
seeries = pd.Series([1,2,3,4,5,6,7,8,9,10])
print(seeries)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [59]:
n = 6
new_serr = seeries[seeries > 6]

In [60]:
print(new_serr.reset_index(drop=True))

0     7
1     8
2     9
3    10
dtype: int64

In [61]:
prac_se = pd.Series([1,2,3,4,5,6,7,8,9,10])
print(prac_se)
print(type(prac_se))
print("---------------------------")
x = 5
print("subset of original series")
sor_pre = prac_se[prac_se > x]
print(sor_pre.reset_index(drop=True))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
<class 'pandas.core.series.Series'>
---------------------------
subset of original series
0     6
1     7
2     8
3     9
4    10
dtype: int64

#  Write a Pandas program to change the order of index of a given series.

In [62]:
import pandas as pd
s = pd.Series(data = [1,2,3,4,5], index = ['A', 'B', 'C','D','E'])
print("Original Data Series:")
print(s)
s = s.reindex(index = ['B','A','C','D','E'])
print("Data Series after changing the order of index:")
print(s)

Original Data Series:
A    1
B    2
C    3
D    4
E    5
dtype: int64
Data Series after changing the order of index:
B    2
A    1
C    3
D    4
E    5
dtype: int64

#  Write a Pandas program to create the mean and standard deviation of the data of a given Series

In [63]:
mean_std = pd.Series([1,2,3,4,5,6,7,8,9,5,3])

In [64]:
mean_std.describe()

count    11.000000
mean      4.818182
std       2.522625
min       1.000000
25%       3.000000
50%       5.000000
75%       6.500000
max       9.000000
dtype: float64

# Write a Pandas program to get the items of a given series not present in another given series

In [65]:
sr1 = pd.Series([1,2,3,4,5])
sr2 = pd.Series([2,4,6,8,10])
print(sr1)
print(sr2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     2
1     4
2     6
3     8
4    10
dtype: int64

In [66]:
result = sr1[~sr1.isin(sr2)]
print(result)

0    1
2    3
4    5
dtype: int64

In [67]:
result = sr1[~sr1.isin(sr2)]
print(result)

0    1
2    3
4    5
dtype: int64

# Write a Pandas program to get the items which are not common of two given series

In [68]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([2,4,6,8,10])
print(s1)
print(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     2
1     4
2     6
3     8
4    10
dtype: int64

In [69]:
s3 = s1[~s1.isin(s2)]
print(s3)

0    1
2    3
4    5
dtype: int64

In [70]:
s4 = s2[~s2.isin(s1)]
print(s4)

2     6
3     8
4    10
dtype: int64

In [71]:
final_series = s3.append(s4)

In [72]:
print(final_series)

0     1
2     3
4     5
2     6
3     8
4    10
dtype: int64

#  Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series

In [73]:
number_state = np.random.RandomState(100)
number_series = pd.Series(number_state.normal(10,4,20))
print(number_series)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64

In [74]:
number_state = np.random.RandomState(100) # setting seed
print(number_state.normal(10,4,20).mean()) # print 20 numbers in normal destribution whose mean is 10 and std is 4
print(number_state.normal(10,4,20).std())  # print 20 numbers in normal destribution whose mean is 10 and std is 4

9.9852785804776
4.08894289527066

In [75]:
percentile = np.percentile(number_series,q=[0,0.25,0.50,0.75,100])
print(percentile)

[ 3.00093811  3.12091308  3.24088805  3.36086303 14.61214321]

# Write a Pandas program to calculate the frequency counts of each unique value of a given series

In [76]:
num_series = pd.Series(np.take(list('0123456789'), np.random.randint(10, size=40)))

In [77]:
print(num_series)

0     7
1     4
2     9
3     9
4     3
5     6
6     0
7     0
8     9
9     3
10    1
11    9
12    2
13    1
14    0
15    5
16    8
17    6
18    5
19    7
20    1
21    2
22    3
23    3
24    8
25    8
26    7
27    3
28    0
29    5
30    4
31    0
32    0
33    9
34    9
35    4
36    0
37    0
38    7
39    8
dtype: object

In [78]:
result = num_series.value_counts()
print(result)

0    8
9    6
3    5
8    4
7    4
5    3
4    3
1    3
2    2
6    2
dtype: int64

# Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series

In [79]:
np.random.RandomState(100)
num_series = pd.Series(np.random.randint(1, 5, [15]))
print("Original Series:")
print(num_series)
print("Top 2 Freq:", num_series.value_counts())
result = num_series[~num_series.isin(num_series.value_counts().index[:1])] = 'Other'
print(num_series)

Original Series:
0     4
1     1
2     4
3     1
4     2
5     3
6     1
7     2
8     1
9     2
10    3
11    4
12    1
13    2
14    1
dtype: int32
Top 2 Freq: 1    6
2    4
4    3
3    2
dtype: int64
0     Other
1         1
2     Other
3         1
4     Other
5     Other
6         1
7     Other
8         1
9     Other
10    Other
11    Other
12        1
13    Other
14        1
dtype: object

# Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series

In [80]:
num_series = pd.Series(np.random.randint(1, 10, 10))
print("Original Series:")
print(num_series)

Original Series:
0    8
1    8
2    3
3    1
4    2
5    8
6    8
7    1
8    9
9    3
dtype: int32

In [81]:
result=[i for i in num_series[num_series%5==0].index]
print(result)

[]

# Write a Pandas program to extract items at given positions of a given series

In [82]:
num_series = pd.Series(list('2390238923902390239023'))
print(num_series)

0     2
1     3
2     9
3     0
4     2
5     3
6     8
7     9
8     2
9     3
10    9
11    0
12    2
13    3
14    9
15    0
16    2
17    3
18    9
19    0
20    2
21    3
dtype: object

In [83]:
element_pos = [0,2,4,7,9]

In [84]:
result =  num_series.take(element_pos)
print(result)

0    2
2    9
4    2
7    9
9    3
dtype: object

# Write a Pandas program to get the positions of items of a given series in another given series.

In [85]:
num_series = pd.Series([1,2,3,4,5,6,7,8,9,10])
num_series2 = pd.Series([1,3,5,7,10])
print(num_series)
print(num_series2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
0     1
1     3
2     5
3     7
4    10
dtype: int64

In [86]:
result = [pd.Index(num_series).get_loc(i) for i in num_series2]
print(result)

[0, 2, 4, 6, 9]

#  Write a Pandas program convert the first and last character of each word to upper case in each word of a given series

In [87]:
s1 = pd.Series(["php","python","java","scala","reddy"])
print(s1)

0       php
1    python
2      java
3     scala
4     reddy
dtype: object

In [88]:
s2 = s1.map(lambda x : x[0].upper() + x[1:-1]+x[-1].upper())

In [89]:
s2

0       PhP
1    PythoN
2      JavA
3     ScalA
4     ReddY
dtype: object

In [90]:
name = pd.Series(['raj',"reddy","tony","india","earth"])
print(name)

0      raj
1    reddy
2     tony
3    india
4    earth
dtype: object

In [91]:
capitalize = name.map(lambda x : x[0].upper() + x[1:-1] + x[-1].upper())
print(capitalize)

0      RaJ
1    ReddY
2     TonY
3    IndiA
4    EartH
dtype: object

In [92]:
pa = pd.Series(["pandas","numpy","sklearn","matplotlib","seaborn"])
print(pa)

0        pandas
1         numpy
2       sklearn
3    matplotlib
4       seaborn
dtype: object

In [93]:
PA = pa.map(lambda x : x[0:2].upper() + x[2:-1] + x[-1].upper())
print(PA)

0        PAndaS
1         NUmpY
2       SKlearN
3    MAtplotliB
4       SEaborN
dtype: object

In [94]:
pp = pd.Series(["pAndas","nUmpy","sKlearn","mAtplotlib","sEaborn"])
print(pp)
new = pp.map(lambda x : x[0].upper() + x[1].lower() + x[2:-1].upper() + x[-1].upper())
print(new)

0        pAndas
1         nUmpy
2       sKlearn
3    mAtplotlib
4       sEaborn
dtype: object
0        PaNDAS
1         NuMPY
2       SkLEARN
3    MaTPLOTLIB
4       SeABORN
dtype: object

#  Write a Pandas program to calculate the number of characters in each word in a given series.

In [95]:
s1 = pd.Series(["php","python","java","scala","reddy"])
print(s1)

0       php
1    python
2      java
3     scala
4     reddy
dtype: object

In [96]:
result = s1.map(lambda x : len(x))
print(result)

0    3
1    6
2    4
3    5
4    5
dtype: int64

In [97]:
pp = pd.Series(["pAndas","nUmpy","sKlearn","mAtplotlib","sEaborn"])
print(pp)
new_result = pp.map(lambda x : len(x))
print(new_result)

0        pAndas
1         nUmpy
2       sKlearn
3    mAtplotlib
4       sEaborn
dtype: object
0     6
1     5
2     7
3    10
4     7
dtype: int64

#  Write a Pandas program to compute difference of differences between consecutive numbers of a given series

In [98]:
ser1 = pd.Series([1,3,5,9,11,13])
print(ser1)
print("---------------------------")
diff = ser1.diff().tolist()
print(diff)
print("---------------------------")
diff_diff = ser1.diff().diff().tolist()
print(diff_diff)

0     1
1     3
2     5
3     9
4    11
5    13
dtype: int64
---------------------------
[nan, 2.0, 2.0, 4.0, 2.0, 2.0]
---------------------------
[nan, nan, 0.0, 2.0, -2.0, 0.0]

#  Write a Pandas program to convert a series of date strings to a timeseries

In [99]:
import pandas as pd
date_series = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
print("Original Series:")
print(date_series)

Original Series:
0         01 Jan 2015
1          10-02-2016
2            20180307
3          2014/05/06
4          2016-04-12
5    2019-04-06T11:20
dtype: object

In [100]:
print("\nSeries of date strings to a timeseries:")
print(pd.to_datetime(date_series))

Series of date strings to a timeseries:
0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

In [101]:
date_series = pd.to_datetime(date_series)
year = date_series.dt.year

In [102]:
year

0    2015
1    2016
2    2018
3    2014
4    2016
5    2019
dtype: int64

In [103]:
month = date_series.dt.month
print(month)

0     1
1    10
2     3
3     5
4     4
5     4
dtype: int64

In [104]:
month_name = date_series.dt.month_name()
print(month_name)

0    January
1    October
2      March
3        May
4      April
5      April
dtype: object

In [105]:
day = date_series.dt.day
print(day)

0     1
1     2
2     7
3     6
4    12
5     6
dtype: int64

In [106]:
dayat = date_series.dt.day_name()
print(dayat)

0     Thursday
1       Sunday
2    Wednesday
3      Tuesday
4      Tuesday
5     Saturday
dtype: object

In [107]:
day2 = date_series.dt.dayofweek
print(day2)

0    3
1    6
2    2
3    1
4    1
5    5
dtype: int64

In [108]:
dayyear = date_series.dt.dayofyear
print(dayyear)

0      1
1    276
2     66
3    126
4    103
5     96
dtype: int64

# Write a Pandas program to get the day of month, day of year, week number and day of week from a given series of date strings

In [109]:
import pandas as pd
from dateutil.parser import parse
date_series = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
print("Original Series:")
print(date_series)
date_series = date_series.map(lambda x: parse(x))
print("Day of month:")
print(date_series.dt.day.tolist())
print("Day of year:")
print(date_series.dt.dayofyear.tolist())
print("Week number:")
print(date_series.dt.weekofyear.tolist())
print("Day of week:")
print(date_series.dt.day_name().tolist())

Original Series:
0         01 Jan 2015
1          10-02-2016
2            20180307
3          2014/05/06
4          2016-04-12
5    2019-04-06T11:20
dtype: object
Day of month:
[1, 2, 7, 6, 12, 6]
Day of year:
[1, 276, 66, 126, 103, 96]
Week number:
[1, 39, 10, 19, 15, 14]
Day of week:
['Thursday', 'Sunday', 'Wednesday', 'Tuesday', 'Tuesday', 'Saturday']

# Write a Pandas program to convert year-month string to dates adding a specified day of the month.

In [110]:
date_series = pd.Series(['Jan 2015', 'Feb 2016', 'Mar 2017', 'Apr 2018', 'May 2019'])
print(date_series)

0    Jan 2015
1    Feb 2016
2    Mar 2017
3    Apr 2018
4    May 2019
dtype: object

In [111]:
date_series = pd.to_datetime(date_series)
print(date_series)

0   2015-01-01
1   2016-02-01
2   2017-03-01
3   2018-04-01
4   2019-05-01
dtype: datetime64[ns]

# Write a Pandas program to filter words from a given series that contain atleast two vowels.

In [112]:
import pandas as pd
from collections import Counter
color_series = pd.Series(['Red', 'Green', 'Orange', 'Pink', 'Yellow', 'White'])
print("Original Series:")
print(color_series)
print("\nFiltered words:")
result = mask = color_series.map(lambda c: sum([Counter(c.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
print(color_series[result])

Original Series:
0       Red
1     Green
2    Orange
3      Pink
4    Yellow
5     White
dtype: object

Filtered words:
1     Green
2    Orange
4    Yellow
5     White
dtype: object

# . Write a Pandas program to compute the Euclidean distance between two given series

In [113]:
x = pd.Series([1,2,3,4,5,6,7,8,9,10])
y = pd.Series([11,8,7,5,6,5,3,4,7,1])
print(x)
print("------------------------------")
print(y)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
------------------------------
0    11
1     8
2     7
3     5
4     6
5     5
6     3
7     4
8     7
9     1
dtype: int64

In [114]:
dis = np.linalg.norm(x-y)
print(dis)

16.492422502470642

# To find out the euclidean distance between two columns
def Euclidean_Dist(df1, df2, cols=['x','y']):
    return np.linalg.norm(df1[cols].values - df2[cols].values,
                   axis=1)

# Write a Pandas program to create a TimeSeries to display all the Sundays of given year.

In [115]:
import pandas as pd
result = pd.Series(pd.date_range('2020-01-01', periods=52, freq='W-SUN'))
print("All Sundays of 2019:")
print(result)

All Sundays of 2019:
0    2020-01-05
1    2020-01-12
2    2020-01-19
3    2020-01-26
4    2020-02-02
5    2020-02-09
6    2020-02-16
7    2020-02-23
8    2020-03-01
9    2020-03-08
10   2020-03-15
11   2020-03-22
12   2020-03-29
13   2020-04-05
14   2020-04-12
15   2020-04-19
16   2020-04-26
17   2020-05-03
18   2020-05-10
19   2020-05-17
20   2020-05-24
21   2020-05-31
22   2020-06-07
23   2020-06-14
24   2020-06-21
25   2020-06-28
26   2020-07-05
27   2020-07-12
28   2020-07-19
29   2020-07-26
30   2020-08-02
31   2020-08-09
32   2020-08-16
33   2020-08-23
34   2020-08-30
35   2020-09-06
36   2020-09-13
37   2020-09-20
38   2020-09-27
39   2020-10-04
40   2020-10-11
41   2020-10-18
42   2020-10-25
43   2020-11-01
44   2020-11-08
45   2020-11-15
46   2020-11-22
47   2020-11-29
48   2020-12-06
49   2020-12-13
50   2020-12-20
51   2020-12-27
dtype: datetime64[ns]

In [116]:
?pd.date_range

In [117]:
result = pd.Series(pd.date_range('2020-01-01', periods=52, freq='W-SUN'))
print(result)

0    2020-01-05
1    2020-01-12
2    2020-01-19
3    2020-01-26
4    2020-02-02
5    2020-02-09
6    2020-02-16
7    2020-02-23
8    2020-03-01
9    2020-03-08
10   2020-03-15
11   2020-03-22
12   2020-03-29
13   2020-04-05
14   2020-04-12
15   2020-04-19
16   2020-04-26
17   2020-05-03
18   2020-05-10
19   2020-05-17
20   2020-05-24
21   2020-05-31
22   2020-06-07
23   2020-06-14
24   2020-06-21
25   2020-06-28
26   2020-07-05
27   2020-07-12
28   2020-07-19
29   2020-07-26
30   2020-08-02
31   2020-08-09
32   2020-08-16
33   2020-08-23
34   2020-08-30
35   2020-09-06
36   2020-09-13
37   2020-09-20
38   2020-09-27
39   2020-10-04
40   2020-10-11
41   2020-10-18
42   2020-10-25
43   2020-11-01
44   2020-11-08
45   2020-11-15
46   2020-11-22
47   2020-11-29
48   2020-12-06
49   2020-12-13
50   2020-12-20
51   2020-12-27
dtype: datetime64[ns]

# Write a Pandas program to convert given series into a dataframe with its index as another column on the dataframe

In [118]:
char_list = list('ABCDEFGHIJKLMNOP')
num_arra = np.arange(8)
num_dict = dict(zip(char_list, num_arra))
num_ser = pd.Series(num_dict)
df = num_ser.to_frame().reset_index()
print(df.head())

  index  0
0     A  0
1     B  1
2     C  2
3     D  3
4     E  4

# Write a Pandas program to check the equality of two given series

In [119]:
nums1 = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
nums2 = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print(nums1)
print(nums2)

0    1
1    8
2    7
3    5
4    6
5    5
6    3
7    4
8    7
9    1
dtype: int64
0    1
1    8
2    7
3    5
4    6
5    5
6    3
7    4
8    7
9    1
dtype: int64

In [120]:
print("Check 2 series are equal or not?")
print(nums1 == nums2)

Check 2 series are equal or not?
0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
dtype: bool

In [121]:
nums = pd.Series([1, 3, 7, 12, 88, 23, 3, 1, 9, 0])
print("Original Series:")
print(nums)
print("Index of the first occurrence of the smallest and largest value of the said series:")
print(nums.idxmin())
print(nums.idxmax())

Original Series:
0     1
1     3
2     7
3    12
4    88
5    23
6     3
7     1
8     9
9     0
dtype: int64
Index of the first occurrence of the smallest and largest value of the said series:
9
4

In [122]:
import pandas as pd
df_data = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],'Z':[86,97,96,72,83]});
sr_data = pd.Series([68, 75, 86, 80, None]) 
print("Original DataFrame:")
print(df_data)
print("\nOriginal Series:")
print(sr_data)
print("\nCheck for inequality of the said series & dataframe:")
print(df_data.ne(sr_data, axis = 0))

Original DataFrame:
      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  75.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  86  72
4   NaN  86.0  86  83

Original Series:
0    68.0
1    75.0
2    86.0
3    80.0
4     NaN
dtype: float64

Check for inequality of the said series & dataframe:
       W      X     Y     Z
0  False   True  True  True
1  False  False  True  True
2  False   True  True  True
3  False  False  True  True
4   True   True  True  True

# DataFrame

# Write a Pandas program to get the powers of an array values element-wise.

In [123]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [124]:
first_array=np.arange(6)
second_array=np.arange(6)
print("first_array")
print(first_array)
print("--------------")
print("second_array")
print(second_array)
print("--------------")
power_array=np.power(first_array,second_array)
print("power_array")
print(power_array)

first_array
[0 1 2 3 4 5]
--------------
second_array
[0 1 2 3 4 5]
--------------
power_array
[   1    1    4   27  256 3125]

# Pandas DataFrame: Create and display a DataFrame from a specified dictionary data which has the index labels

In [125]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [127]:
df.describe()

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [128]:
df.describe(include=object)

           name qualify
count        10      10
unique       10       2
top     Matthew      no
freq          1       5

In [129]:
df.iloc[0:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [130]:
df.columns

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [131]:
print(df[["name","score"]])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [132]:
print(df.iloc[[1, 3, 5, 6], [1, 3]])

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [133]:
df.iloc[[0,5],[1,3]]

   score qualify
a   12.5     yes
f   20.0     yes

In [134]:
print(df[df["attempts"]>2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [135]:
df.isnull().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [136]:
df[df["score"].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [137]:
df[(df["score"]>15) & (df["score"]<=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

# Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [138]:
df[(df["attempts"]<2) & (df["score"]>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

#  Write a Pandas program to change the score in row 'd' to 11.5

In [139]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [140]:
df.loc["d","score"] = 11.5

In [141]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [142]:
df.loc["h","score"] = 13.5

In [143]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [144]:
df.loc["a","qualify"] = "no"

In [145]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [146]:
df.loc["b","attempts"] = 2

In [147]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [148]:
df.columns

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

# Write a Pandas program to calculate the sum of the examination attempts by the students

In [149]:
df.describe()

           score   attempts
count  10.000000  10.000000
mean   13.350000   1.800000
std     4.190266   0.788811
min     8.000000   1.000000
25%     9.625000   1.000000
50%    13.000000   2.000000
75%    16.000000   2.000000
max    20.000000   3.000000

In [150]:
df.attempts.sum()

18

In [151]:
df.score.mean()

13.35

In [152]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [153]:
df.loc["k"] = ["ambani",20.5,2,"yes"]

In [154]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     ambani   20.5         2     yes

In [155]:
df = df.drop('k')

In [156]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [157]:
df.sort_values(by=["name","score"],ascending=[False,True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         2      no
a  Anastasia   12.5         1      no

In [158]:
df.sort_values(by=["name","score","attempts","qualify"],ascending=[True,False,True,False])

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura   13.5         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [159]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1      no
b       Dima    9.0         2      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   13.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [160]:
df.qualify = df.qualify.map({"yes":True,"no":False})

In [161]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1    False
b       Dima    9.0         2    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura   13.5         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

# Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame

In [162]:
df.name = df.name.str.replace("James","suresh")

In [163]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1    False
b       Dima    9.0         2    False
c  Katherine   16.5         2     True
d     suresh   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura   13.5         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [164]:
df.pop("attempts")

a    1
b    2
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [165]:
df

        name  score  qualify
a  Anastasia   12.5    False
b       Dima    9.0    False
c  Katherine   16.5     True
d     suresh   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura   13.5    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [166]:
color = ["red","yellow","pink","black","blue","violet","green","indogi","orange","brown"]

In [167]:
df["color"] = color

In [168]:
df

        name  score  qualify   color
a  Anastasia   12.5    False     red
b       Dima    9.0    False  yellow
c  Katherine   16.5     True    pink
d     suresh   11.5    False   black
e      Emily    9.0    False    blue
f    Michael   20.0     True  violet
g    Matthew   14.5     True   green
h      Laura   13.5    False  indogi
i      Kevin    8.0    False  orange
j      Jonas   19.0     True   brown

In [169]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

In [170]:
df

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

# Write a Pandas program to get list from DataFrame column headers

In [171]:
df

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

In [172]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

In [173]:
df.columns.values

array(['name', 'score', 'attempts', 'qualify'], dtype=object)

#  Write a Pandas program to rename columns of a given DataFrame

In [174]:
df1 = pd.DataFrame({"col1":[1,2,3,4],
                   "col2":[2,3,4,5],
                   "col3":[3,4,5,6]})

In [175]:
print(df1)

   col1  col2  col3
0     1     2     3
1     2     3     4
2     3     4     5
3     4     5     6

In [176]:
df1.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [177]:
df1.columns = ["column1","column2","column3"]

In [178]:
df1

   column1  column2  column3
0        1        2        3
1        2        3        4
2        3        4        5
3        4        5        6

In [179]:
import copy

In [180]:
num = [1,2,3,[4,5],6]

In [181]:
num2 = copy.copy(num)

In [182]:
num2

[1, 2, 3, [4, 5], 6]

In [183]:
num = num.pop(2)

In [184]:
num2

[1, 2, 3, [4, 5], 6]

In [185]:
num

3

In [186]:
df2 = copy.deepcopy(df1)

In [187]:
df2

   column1  column2  column3
0        1        2        3
1        2        3        4
2        3        4        5
3        4        5        6

In [188]:
df1

   column1  column2  column3
0        1        2        3
1        2        3        4
2        3        4        5
3        4        5        6

In [189]:
df1.drop("column1",axis=1,inplace=True)

In [190]:
df1

   column2  column3
0        2        3
1        3        4
2        4        5
3        5        6

In [191]:
df2

   column1  column2  column3
0        1        2        3
1        2        3        4
2        3        4        5
3        4        5        6

# Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [192]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('Rows for colum1 value == 4')
print(df.loc[df['col1'] == 4])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

# Write a Pandas program to change the order of a DataFrame columns

In [193]:
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [194]:
df[["col3","col2","col1"]]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

In [195]:
names = pd.Series(["andhra","telangana","rayalaseema"])

In [196]:
names = names.map(lambda x : x[0].upper() + x[1:5] + x[5:-1].upper() + x[-1].upper())

In [197]:
names

0         AndhrA
1      TelanGANA
2    RayalASEEMA
dtype: object

# Write a Pandas program to add one row in an existing DataFrame.

In [198]:
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [199]:
df.loc[5] = [2,3,4]

In [200]:
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5     2     3     4

In [201]:
exam_data = {
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data)
print(df, '\n')
print(len(exam_data['name']))
df.loc[len(exam_data['name'])] = [3, 5, 6, 7]
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

10
         name  score  attempts qualify
0   Anastasia   12.5         1     yes
1        Dima    9.0         3      no
2   Katherine   16.5         2     yes
3       James    NaN         3      no
4       Emily    9.0         2      no
5     Michael   20.0         3     yes
6     Matthew   14.5         1     yes
7       Laura    NaN         1      no
8       Kevin    8.0         2      no
9       Jonas   19.0         1     yes
10          3    5.0         6       7

In [202]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('After add one row:')
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df = df.append(df2, ignore_index=True)
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
After add one row:
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

# Write a Pandas program to write a DataFrame to CSV file using tab separator

In [203]:
data = pd.DataFrame({"name":["p","t","r","e"],
                    "age":[2,3,4,5],
                    "salary":[22,33,54,66]})

In [204]:
data

  name  age  salary
0    p    2      22
1    t    3      33
2    r    4      54
3    e    5      66

In [205]:
data.to_csv("new_data.csv",sep="\t",index=False)

In [206]:
new_data = pd.read_csv("new_data.csv")

In [207]:
print(new_data)

  name\tage\tsalary
0          p\t2\t22
1          t\t3\t33
2          r\t4\t54
3          e\t5\t66

# Write a Pandas program to count city wise number of people from a given of data set (city, name of the person)

In [208]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

# Write a Pandas program to delete DataFrame row(s) based on given column value

In [209]:
d = {"col1":[1,2,3,4,5],
    "col2":[4,5,6,7,8],
    "col3":[3,4,5,6,7]}

In [210]:
data = pd.DataFrame(data=d)

In [211]:
data

   col1  col2  col3
0     1     4     3
1     2     5     4
2     3     6     5
3     4     7     6
4     5     8     7

In [212]:
data[data.col2!=5]

   col1  col2  col3
0     1     4     3
2     3     6     5
3     4     7     6
4     5     8     7

In [213]:
data[data.col1!=5]

   col1  col2  col3
0     1     4     3
1     2     5     4
2     3     6     5
3     4     7     6

#  Write a Pandas program to widen output display to see more columns

In [214]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

# Write a Pandas program to select a row of series/dataframe by given integer index

In [215]:
index1 = df.iloc[[2]]
print(index1)

   col1  col2  col3
2     3     6     9

In [216]:
df.iloc[[2]]

   col1  col2  col3
2     3     6     9

# Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [217]:
d = {"attempts":[1,2,1,1,3,2],
    "name":["p","r","k","t","f","s"],
    "qualify":["no","yes","yes","no","yes","no"],
    "score":[12,16,17,np.nan,18,np.nan]}

In [218]:
data = pd.DataFrame(data=d)

In [219]:
data.isnull().sum()

attempts    0
name        0
qualify     0
score       2
dtype: int64

In [220]:
data.isna().sum()

attempts    0
name        0
qualify     0
score       2
dtype: int64

In [221]:
data = data.fillna(0)

In [222]:
data

   attempts name qualify  score
0         1    p      no   12.0
1         2    r     yes   16.0
2         1    k     yes   17.0
3         1    t      no    0.0
4         3    f     yes   18.0
5         2    s      no    0.0

# Write a Pandas program to convert index in a column of the given dataframe

In [223]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [224]:
df.reset_index(level=0,inplace=True)

In [225]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

In [226]:
print(df.to_string(index=False))

 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

# Write a Pandas program to set a given value for particular cell in  DataFrame using index value

In [227]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [228]:
df.loc[8,"score"]=10.2

In [229]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

In [230]:
df.at[8,"score"]=20

In [231]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   20.0         2      no
9      Jonas   19.0         1     yes

# Write a Pandas program to combining two series into a DataFrame

In [232]:
ser1 = pd.Series([1,2,"python",33])
ser2 = pd.Series([4,5,"javascript",77])
print(ser1)
print(ser2)

0         1
1         2
2    python
3        33
dtype: object
0             4
1             5
2    javascript
3            77
dtype: object

In [233]:
data = pd.concat([ser1,ser2],axis=1)

In [234]:
data

        0           1
0       1           4
1       2           5
2  python  javascript
3      33          77

# Write a Pandas program to shuffle a given DataFrame rows

In [235]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [236]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [237]:
df.sample(frac=1)

        name  score  attempts qualify
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
7      Laura    NaN         1      no
5    Michael   20.0         3     yes
3      James    NaN         3      no
8      Kevin    8.0         2      no

# Write a Pandas program to convert DataFrame column type from string to datetime.

In [238]:
s = pd.Series(["1/11/2000","2/12/2000","3/13/2000"])

In [239]:
r = pd.to_datetime(s)

In [240]:
r

0   2000-01-11
1   2000-02-12
2   2000-03-13
dtype: datetime64[ns]

In [241]:
d = pd.DataFrame(r)

In [242]:
d

           0
0 2000-01-11
1 2000-02-12
2 2000-03-13

# Write a Pandas program to rename a specific column name in a given DataFrame

In [243]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)

In [244]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [245]:
df = df.rename(columns={"col1" : "column"})

In [246]:
df

   column  col2  col3
0       1     4     7
1       2     5     8
2       3     6     9

In [247]:
d = {"name":["k","l","m","n"],
    "age":[1,2,3,4],
     "gender":["m","f","m","f"],
    "city":["a","b","c","d"]}

In [248]:
data = pd.DataFrame(data=d)
print(data)

  name  age gender city
0    k    1      m    a
1    l    2      f    b
2    m    3      m    c
3    n    4      f    d

In [249]:
data = data.rename(columns={"name":"yes","age":"no","gender":"yes","city":"no"})

In [250]:
data

  yes no yes no
0   k  1   m  a
1   l  2   f  b
2   m  3   m  c
3   n  4   f  d

#  Write a Pandas program to get a list of a specified column of a DataFrame

In [251]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)

In [252]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [253]:
df["col2"].tolist()

[4, 5, 6]

# Write a Pandas program to find the row for where the value of a given column is maximum

In [254]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)

In [255]:
df.col1.argmax()

4

In [256]:
df.col2.argmax()

3

In [257]:
df.col3.argmax()

2

# Write a Pandas program to check whether a given column is present in a DataFrame or not

In [258]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print(df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [259]:
if "col4" in df.columns:
    print("col4 is present in dataframe")
else:
    print("col4 is not present in dataframe")

col4 is not present in dataframe

In [260]:
if "col1" in df.columns:
    print("col1 is presemt in dataframe :-)")
else:
    print("col1 is not present in dataframe  :-(")

col1 is presemt in dataframe :-)

#  Write a Pandas program to get the specified row value of a given DataFrame

In [261]:
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [262]:
df.iloc[0]

col1    1
col2    4
col3    7
Name: 0, dtype: int64

In [263]:
df.iloc[1]

col1    2
col2    5
col3    8
Name: 1, dtype: int64

#  Write a Pandas program to get the datatypes of columns of a DataFrame

In [264]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [265]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [266]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

# Write a Pandas program to sort a given DataFrame by two or more columns.

In [267]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [268]:
df.sort_values(["attempts","name"],ascending=[True,True])

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

# Write a Pandas program to convert the datatype of a given column(floats to ints).

In [269]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [270]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     10 non-null     float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [271]:
df.score = df.score.astype(int)

In [272]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     10 non-null     int32
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: int32(1), int64(1), object(2)
memory usage: 408.0+ bytes

# Write a Pandas program to remove infinite values from a given DataFrame.

In [273]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

In [274]:
df = df.replace([np.inf,-np.inf],np.nan)
print(df)

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

# Write a Pandas program to convert a given list of lists into a Dataframe.

In [275]:
my_list = [["col1","col2"],[1,2],[3,4]]
print(my_list)

[['col1', 'col2'], [1, 2], [3, 4]]

In [276]:
headers = my_list.pop(0)
print(headers)

['col1', 'col2']

In [277]:
d = pd.DataFrame(my_list,columns=headers)
print(d)

   col1  col2
0     1     2
1     3     4

In [278]:
dogs = [["tony","tommy"],[14,15],["foreign","desi"]]
print(dogs)

[['tony', 'tommy'], [14, 15], ['foreign', 'desi']]

In [279]:
col = dogs.pop(0)
print(col)

['tony', 'tommy']

In [280]:
dog_data = pd.DataFrame(dogs,columns=col)
print(dog_data)

      tony tommy
0       14    15
1  foreign  desi

In [281]:
dog_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tony    2 non-null      object
 1   tommy   2 non-null      object
dtypes: object(2)
memory usage: 160.0+ bytes

In [282]:
len(dog_data.columns)

2

In [283]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print(df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [284]:
df.loc[:,df.columns!="col3"]

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [285]:
df.iloc[:,[0,2]]

   col1  col3
0     1     7
1     2     8
2     3    12
3     4     1
4     7    11

In [286]:
df.iloc[:,[-1]]

   col3
0     7
1     8
2    12
3     1
4    11

In [287]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\ntopmost n records within each group of a DataFrame:")
df1 = df.nlargest(3, 'col1')
print(df1)
df2 = df.nlargest(3, 'col2')
print(df2)
df3 = df.nlargest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

# Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [288]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

In [289]:
df.loc[:,::-1]

    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

In [290]:
df.loc[::-1]

    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

# Write a Pandas program to select columns by data type of a given DataFrame.

In [291]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)

Original DataFrame
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

In [292]:
df.select_dtypes(include="number")

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [293]:
df.select_dtypes(include="object")

             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

# Write a Pandas program to split a given DataFrame into two random subsets.

In [294]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': ['18', '21', '22', '22', '23']
})
print(df)

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23

In [295]:
df_sam1 = df.sample(frac=0.6)
print(df_sam1)
print("---------------------------")
df_sam2 = df.drop(df_sam1.index)
print(df_sam2)

             name date_of_birth age
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
0  Alberto Franco    17/05/2002  18
---------------------------
           name date_of_birth age
1  Gino Mcneill    16/02/1999  21
4  Syed Wharton    15/09/1997  23

# Write a Pandas program to rename all columns with the same pattern of a given DataFrame

In [296]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)

Original DataFrame
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [297]:
df.columns = df.columns.str.lower()

In [298]:
df.columns

Index(['name', 'date_of_birth ', 'age'], dtype='object')

In [299]:
df.columns = df.columns.str.lower().str.rstrip()

In [300]:
df.columns

Index(['name', 'date_of_birth', 'age'], dtype='object')

In [301]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
print("Original DataFrame:")
print(df)
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(df["age_groups"])

Original DataFrame:
             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

Age group:
0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

In [302]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nGlobal usage of memory of the DataFrame:")
print(df.info(memory_usage = "deep"))
print("\nThe usage of memory of every column of the said DataFrame:")
print(df.memory_usage(deep = True))

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Global usage of memory of the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Date_Of_Birth   5 non-null      object
 2   Age             5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes
None

The usage of memory of every column of the said DataFrame:
Index             128
Name              346
Date_Of_Birth     335
Age                40
dtype: int64

# Write a Pandas program to combine many given series to create a DataFrame

In [303]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Original Series:")
print(sr1)
print(sr2)
print("Combine above series to a dataframe:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())
print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())
print("\nUsing pandas DataFrame with a dictionary, gives a specific name to the columns:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))

Original Series:
0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64
Combine above series to a dataframe:
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

Using pandas concat:
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

Using pandas DataFrame with a dictionary, gives a specific name to the columns:
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

# Pandas Indexing

# Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [304]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [305]:
df.head()

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5

In [306]:
df.tail()

  school_code class          name date_Of_Birth  weight  address t_id
1        s002     V  Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI   Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI  Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V  Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI  David Parkes    15/09/1997      32  street4   t6

In [307]:
df1 = df.set_index("school_code")
print(df1)

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

In [308]:
df2 = df.set_index("t_id")
print(df2)

     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

# Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

In [309]:
df3 = df.set_index(["t_id","school_code"])
print(df3)

                 class            name date_Of_Birth  weight  address
t_id school_code
t1   s001            V  Alberto Franco    15/05/2002      35  street1
t2   s002            V    Gino Mcneill    17/05/2002      32  street2
t3   s003           VI     Ryan Parkes    16/02/1999      33  street3
t4   s001           VI    Eesha Hinton    25/09/1998      30  street1
t5   s002            V    Gino Mcneill    11/05/2002      31  street2
t6   s004           VI    David Parkes    15/09/1997      32  street4

In [310]:
df4 = df.set_index([pd.Index([0, 1, 2, 3, 4, 5]), 't_id'])
print(df4)

       school_code class            name date_Of_Birth  weight  address
  t_id
0 t1          s001     V  Alberto Franco    15/05/2002      35  street1
1 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6          s004    VI    David Parkes    15/09/1997      32  street4

In [311]:
df5 = df.set_index([pd.Index([3,4,5,6,7,8]),"t_id"])
print(df5)

       school_code class            name date_Of_Birth  weight  address
  t_id
3 t1          s001     V  Alberto Franco    15/05/2002      35  street1
4 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
5 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
6 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
7 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
8 t6          s004    VI    David Parkes    15/09/1997      32  street4

# Write a Pandas program to display the default index and set a column as an Index in a given dataframe and then reset the index

In [312]:
df.head()

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5

In [313]:
df6 = df.set_index("t_id")
print(df6)

     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

In [314]:
df7 = df.reset_index(drop=True)
print(df7)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

# Write a Pandas program to create an index labels by using 64-bit integers, using floating-point numbers in a given dataframe

In [315]:
import pandas as pd
print("Create an Int64Index:")
df_i64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[1, 2, 3, 4, 5, 6])
print(df_i64)
print("\nView the Index:")
print(df_i64.index)

print("\nFloating-point labels using Float64Index:")
df_f64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[.1, .2, .3, .4, .5, .6])
print(df_f64)
print("\nView the Index:")
print(df_f64.index)

Create an Int64Index:
  school_code class            name date_Of_Birth  weight  address
1        s001     V  Alberto Franco    15/05/2002      35  street1
2        s002     V    Gino Mcneill    17/05/2002      32  street2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1
5        s002     V    Gino Mcneill    11/05/2002      31  street2
6        s004    VI    David Parkes    15/09/1997      32  street4

View the Index:
Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

Floating-point labels using Float64Index:
    school_code class            name date_Of_Birth   weight  address
0.1        s001     V  Alberto Franco     15/05/2002      35  street1
0.2        s002     V    Gino Mcneill     17/05/2002      32  street2
0.3        s003    VI     Ryan Parkes     16/02/1999      33  street3
0.4        s001    VI    Eesha Hinton     25/09/1998      30  street1
0.5        s002     V    Gino Mcneill     11/05/2002      31  street2
0.6        s004    VI    David Parkes     15/09/1997      32  street4

View the Index:
Float64Index([0.1, 0.2, 0.3, 0.4, 0.5, 0.6], dtype='float64')

In [316]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame:")
print(df)
print("\nConvert index of the said dataframe into a column:")
df.reset_index(level=0, inplace=True)
print(df)

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Convert index of the said dataframe into a column:
  index school_code class            name date_of_birth  weight
0    t1        s001     V  Alberto Franco    15/05/2002      35
1    t2        s002     V    Gino Mcneill    17/05/2002      32
2    t3        s003    VI     Ryan Parkes    16/02/1999      33
3    t4        s001    VI    Eesha Hinton    25/09/1998      30
4    t5        s002     V    Gino Mcneill    11/05/2002      31
5    t6        s004    VI    David Parkes    15/09/1997      32

# Pandas: String and Regular Expression

# Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values

In [317]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])
print(s)

0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object

In [318]:
s_upper = s.str.upper()
print(s_upper)

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [319]:
s_lower = s.str.lower()
print(s_lower)

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

In [320]:
s_length = len(s)
print(s_length)

11

In [321]:
s.str.len()

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

# Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series

In [322]:
color = pd.Index([" RED","BLUE "," GREEN ","BLACK","BROWN "])
print(color)

Index([' RED', 'BLUE ', ' GREEN ', 'BLACK', 'BROWN '], dtype='object')

In [323]:
col_l = color.str.lstrip()
print(col_l)

Index(['RED', 'BLUE ', 'GREEN ', 'BLACK', 'BROWN '], dtype='object')

In [324]:
col_r = color.str.rstrip()
print(col_r)

Index([' RED', 'BLUE', ' GREEN', 'BLACK', 'BROWN'], dtype='object')

In [325]:
col = color.str.strip()
print(col)

Index(['RED', 'BLUE', 'GREEN', 'BLACK', 'BROWN'], dtype='object')

In [326]:
name = pd.Index([" prithvi"," tony ","tommy "])
print(name)

Index([' prithvi', ' tony ', 'tommy '], dtype='object')

In [327]:
name_l = name.str.lstrip()
print(name_l)

Index(['prithvi', 'tony ', 'tommy '], dtype='object')

In [328]:
name_l = name.str.rstrip()
print(name_l)

Index([' prithvi', ' tony', 'tommy'], dtype='object')

In [329]:
name = name.str.strip()
print(name)

Index(['prithvi', 'tony', 'tommy'], dtype='object')

# Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit

In [330]:
num = {"amount":[10,250,3000,40000,500000]}
df = pd.DataFrame(data=num)
print(df)

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [331]:
df["amount"] = df["amount"].apply(lambda x: '{0:0>8}'.format(x))

In [332]:
df["amount"]

0    00000010
1    00000250
2    00003000
3    00040000
4    00500000
Name: amount, dtype: object

# Write a Pandas program to add leading zeros to the character column in a pandas series and makes the length of the field to 8 digit

In [333]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(10), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
       amount
0  0000000010
1  0000000250
2  0000003000
3  0000040000
4  0000500000

In [334]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(7), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
    amount
0  0000010
1  0000250
2  0003000
3  0040000
4  0500000

In [335]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(5), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
   amount
0   00010
1   00250
2   03000
3   40000
4  500000

In [336]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(8), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

In [337]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(12), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:
         amount
0  000000000010
1  000000000250
2  000000003000
3  000000040000
4  000000500000

# Write a Pandas program to capitalize all the string values of specified columns of a given DataFrame

In [338]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)

      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

In [339]:
df["name"] = list(map(lambda x : x.capitalize(),df["name"]))

In [340]:
df["name"]

0    Alberto
1       Gino
2       Ryan
3      Eesha
4       Syed
Name: name, dtype: object

In [341]:
df["name"] = list(map(lambda x : x.upper(),df["name"]))
print(df["name"])

0    ALBERTO
1       GINO
2       RYAN
3      EESHA
4       SYED
Name: name, dtype: object

# Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

In [342]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)

  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [343]:
df["count_of _2"] = list(map(lambda x : x.count("2"),df["name_code"]))
print(df)

  name_code date_of_birth    age  count_of _2
0      c001     12/05/2002  18.5            0
1      c002     16/02/1999  21.2            1
2      c022     25/09/1998  22.5            2
3     c2002     12/02/2022  22.0            2
4     c2222     15/09/1997  23.0            4

In [344]:
df["count_of_0"] = list(map(lambda x : x.count("0"),df["name_code"]))
print(df)

  name_code date_of_birth    age  count_of _2  count_of_0
0      c001     12/05/2002  18.5            0           2
1      c002     16/02/1999  21.2            1           2
2      c022     25/09/1998  22.5            2           1
3     c2002     12/02/2022  22.0            2           2
4     c2222     15/09/1997  23.0            4           0

In [345]:
cc = pd.Series(["cc12300","cc00011","cc12300","cc22330","cc11103"])
print(cc)

0    cc12300
1    cc00011
2    cc12300
3    cc22330
4    cc11103
dtype: object

In [346]:
data = pd.DataFrame(cc,columns=["id_no"])
print(data)

     id_no
0  cc12300
1  cc00011
2  cc12300
3  cc22330
4  cc11103

In [347]:
data["no_of_c"] = list(map(lambda x: x.count("c"),data["id_no"]))
print(data)

     id_no  no_of_c
0  cc12300        2
1  cc00011        2
2  cc12300        2
3  cc22330        2
4  cc11103        2

In [348]:
data["no_of_1"] = list(map(lambda x : x.count("1"),data["id_no"]))
print(data)

     id_no  no_of_c  no_of_1
0  cc12300        2        1
1  cc00011        2        2
2  cc12300        2        1
3  cc22330        2        0
4  cc11103        2        3

In [349]:
data["no_of_2"] = list(map(lambda x: x.count("2"),data["id_no"]))
print(data)

     id_no  no_of_c  no_of_1  no_of_2
0  cc12300        2        1        1
1  cc00011        2        2        0
2  cc12300        2        1        1
3  cc22330        2        0        2
4  cc11103        2        3        0

In [350]:
data["no_of_3"] = list(map(lambda x : x.count("3"),data["id_no"]))
print(data)

     id_no  no_of_c  no_of_1  no_of_2  no_of_3
0  cc12300        2        1        1        1
1  cc00011        2        2        0        0
2  cc12300        2        1        1        1
3  cc22330        2        0        2        2
4  cc11103        2        3        0        1

In [351]:
data["no_of_0"] = list(map(lambda x : x.count("0"),data["id_no"]))
print(data)

     id_no  no_of_c  no_of_1  no_of_2  no_of_3  no_of_0
0  cc12300        2        1        1        1        2
1  cc00011        2        2        0        0        3
2  cc12300        2        1        1        1        2
3  cc22330        2        0        2        2        1
4  cc11103        2        3        0        1        1

#  Write a Pandas program to find the index of a given substring of a DataFrame column.

In [352]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)

  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [353]:
df['Index'] = list(map(lambda x: x.find('22'), df['name_code']))
print(df['Index'])

0   -1
1   -1
2    2
3   -1
4    1
Name: Index, dtype: int64

# . Write a Pandas program to find the index of a substring of DataFrame with beginning and end position

In [354]:
df = pd.DataFrame({
    'name_code': ['c0001','1000c','b00c2', 'b2c02', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)

Original DataFrame:
  name_code date_of_birth    age
0     c0001     12/05/2002  18.5
1     1000c     16/02/1999  21.2
2     b00c2     25/09/1998  22.5
3     b2c02     12/02/2022  22.0
4     c2222     15/09/1997  23.0

In [355]:
df["index_c"] = list(map(lambda x : x.find("c",0,5),df["name_code"]))
print(df)

  name_code date_of_birth    age  index_c
0     c0001     12/05/2002  18.5        0
1     1000c     16/02/1999  21.2        4
2     b00c2     25/09/1998  22.5        3
3     b2c02     12/02/2022  22.0        2
4     c2222     15/09/1997  23.0        0

In [356]:
df["index_b"] = list(map(lambda x : x.find("b",0,5),df["name_code"]))
print(df)

  name_code date_of_birth    age  index_c  index_b
0     c0001     12/05/2002  18.5        0       -1
1     1000c     16/02/1999  21.2        4       -1
2     b00c2     25/09/1998  22.5        3        0
3     b2c02     12/02/2022  22.0        2        0
4     c2222     15/09/1997  23.0        0       -1

#  Write a Pandas program to check whether alpha numeric values present in a given column of a DataFrame

In [357]:
df = pd.DataFrame({
    'name_code': ['Company','Company a001','Company 123', '1234', 'Company 12'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)

Original DataFrame:
      name_code date_of_birth    age
0       Company     12/05/2002  18.5
1  Company a001     16/02/1999  21.2
2   Company 123     25/09/1998  22.5
3          1234     12/02/2022  22.0
4    Company 12     15/09/1997  23.0

In [358]:
df["is_alpha_numeric"] = list(map(lambda x : x.isalnum(),df["name_code"]))
print(df)

      name_code date_of_birth    age  is_alpha_numeric
0       Company     12/05/2002  18.5              True
1  Company a001     16/02/1999  21.2             False
2   Company 123     25/09/1998  22.5             False
3          1234     12/02/2022  22.0              True
4    Company 12     15/09/1997  23.0             False

#  Write a Pandas program to check whether alphabetic values present in a given column of a DataFrame.

In [359]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001','Company 123', 'abcd', 'Company 12'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print(df)

   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2   Company 123    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4    Company 12    15/09/1997         23.0

In [360]:
df["is_alphabet"] = list(map(lambda x : x.isalpha(),df["company_code"]))
print(df)

   company_code date_of_sale   sale_amount  is_alphabet
0       Company    12/05/2002      12348.5         True
1  Company a001    16/02/1999     233331.2        False
2   Company 123    25/09/1998         22.5        False
3          abcd    12/02/2022    2566552.0         True
4    Company 12    15/09/1997         23.0        False

#  Write a Pandas program to check whether only numeric values present in a given column of a DataFrame

In [361]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001', '2055', 'abcd', '123345'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print(df)

   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2          2055    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4        123345    15/09/1997         23.0

In [362]:
df["is_digit"] = list(map(lambda x : x.isdigit(),df["company_code"]))
print(df)

   company_code date_of_sale   sale_amount  is_digit
0       Company    12/05/2002      12348.5     False
1  Company a001    16/02/1999     233331.2     False
2          2055    25/09/1998         22.5      True
3          abcd    12/02/2022    2566552.0     False
4        123345    15/09/1997         23.0      True

# Write a Pandas program to check whether only lower case or upper case is present in a given column of a DataFrame

In [363]:
df = pd.DataFrame({
    'company_code': ['ABCD','EFGF', 'hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print(df)

  company_code date_of_sale   sale_amount
0         ABCD    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0

In [364]:
df["is_lower"] = list(map(lambda x : x.islower(),df["company_code"]))
print(df)

  company_code date_of_sale   sale_amount  is_lower
0         ABCD    12/05/2002      12348.5     False
1         EFGF    16/02/1999     233331.2     False
2         hhhh    25/09/1998         22.5      True
3         abcd    12/02/2022    2566552.0      True
4      EAWQaaa    15/09/1997         23.0     False

In [365]:
df["is_upper"] = list(map(lambda x : x.isupper() , df["company_code"]))
print(df)

  company_code date_of_sale   sale_amount  is_lower  is_upper
0         ABCD    12/05/2002      12348.5     False      True
1         EFGF    16/02/1999     233331.2     False      True
2         hhhh    25/09/1998         22.5      True     False
3         abcd    12/02/2022    2566552.0      True     False
4      EAWQaaa    15/09/1997         23.0     False     False

# Write a Pandas program to check whether only proper case or title case is present in a given column of a DataFrame

In [366]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'Hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print(df)

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         Hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0

In [367]:
df["company_code_is_title"] = list(map(lambda x : x.istitle() , df["company_code"]))
print(df)

  company_code date_of_sale   sale_amount  company_code_is_title
0         Abcd    12/05/2002      12348.5                   True
1         EFGF    16/02/1999     233331.2                  False
2         Hhhh    25/09/1998         22.5                   True
3         abcd    12/02/2022    2566552.0                  False
4      EAWQaaa    15/09/1997         23.0                  False

# Write a Pandas program to check whether only space is present in a given column of a DataFrame

In [368]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF ', '  ', 'abcd', ' '],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print(df)

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1        EFGF     16/02/1999     233331.2
2                 25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4                 15/09/1997         23.0

In [369]:
df["is_space"] = list(map(lambda x : x.isspace() , df["company_code"]))
print(df)

  company_code date_of_sale   sale_amount  is_space
0         Abcd    12/05/2002      12348.5     False
1        EFGF     16/02/1999     233331.2     False
2                 25/09/1998         22.5      True
3         abcd    12/02/2022    2566552.0     False
4                 15/09/1997         23.0      True

#  Write a Pandas program to get the length of the string present of a given column in a DataFrame

In [370]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

In [371]:
print(df)

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2      skfsalf    25/09/1998         22.5
3      sdfslew    12/02/2022    2566552.0
4       safsdf    15/09/1997         23.0

In [372]:
df["company_code_length"] = df["company_code"].apply(len)

In [373]:
df

  company_code date_of_sale   sale_amount  company_code_length
0         Abcd    12/05/2002      12348.5                    4
1         EFGF    16/02/1999     233331.2                    4
2      skfsalf    25/09/1998         22.5                    7
3      sdfslew    12/02/2022    2566552.0                    7
4       safsdf    15/09/1997         23.0                    6

In [374]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [375]:
exam_data = pd.DataFrame(exam_data)

In [376]:
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [377]:
exam_data["name_length"] = exam_data["name"].apply(len)
print(exam_data)

        name  score  attempts qualify  name_length
0  Anastasia   12.5         1     yes            9
1       Dima    9.0         3      no            4
2  Katherine   16.5         2     yes            9
3      James    NaN         3      no            5
4      Emily    9.0         2      no            5
5    Michael   20.0         3     yes            7
6    Matthew   14.5         1     yes            7
7      Laura    NaN         1      no            5
8      Kevin    8.0         2      no            5
9      Jonas   19.0         1     yes            5

In [378]:
exam_data["qualify_length"] = exam_data["qualify"].apply(len)
print(exam_data)

        name  score  attempts qualify  name_length  qualify_length
0  Anastasia   12.5         1     yes            9               3
1       Dima    9.0         3      no            4               2
2  Katherine   16.5         2     yes            9               3
3      James    NaN         3      no            5               2
4      Emily    9.0         2      no            5               2
5    Michael   20.0         3     yes            7               3
6    Matthew   14.5         1     yes            7               3
7      Laura    NaN         1      no            5               2
8      Kevin    8.0         2      no            5               2
9      Jonas   19.0         1     yes            5               3

In [379]:
details = {
          "name" : ["prithvi" , "tony" , "tommy" , "snoopy" , "grumpy" , "tiger"],
          "city" : ["hyderabad" , "corridor" , "balcony" , "house" , "hospital" , "zoo"],
          "age" : [12 , 13 , 14 , 15 , 16 , 17]
          }
print(details)

{'name': ['prithvi', 'tony', 'tommy', 'snoopy', 'grumpy', 'tiger'], 'city': ['hyderabad', 'corridor', 'balcony', 'house', 'hospital', 'zoo'], 'age': [12, 13, 14, 15, 16, 17]}

In [380]:
details_df = pd.DataFrame(details)
print(details_df)

      name       city  age
0  prithvi  hyderabad   12
1     tony   corridor   13
2    tommy    balcony   14
3   snoopy      house   15
4   grumpy   hospital   16
5    tiger        zoo   17

In [381]:
details_df["name_length"] = details_df["name"].apply(len)
print(details_df)

      name       city  age  name_length
0  prithvi  hyderabad   12            7
1     tony   corridor   13            4
2    tommy    balcony   14            5
3   snoopy      house   15            6
4   grumpy   hospital   16            6
5    tiger        zoo   17            5

In [382]:
details_df["cith_length"] = details_df["city"].apply(len)
print(details_df)

      name       city  age  name_length  cith_length
0  prithvi  hyderabad   12            7            9
1     tony   corridor   13            4            8
2    tommy    balcony   14            5            7
3   snoopy      house   15            6            5
4   grumpy   hospital   16            6            8
5    tiger        zoo   17            5            3

#  Write a Pandas program to get the length of the integer of a given column in a DataFrame

In [383]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print(df)

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0

In [384]:
df["sale_amount_length"] = df["sale_amount"].map(str).apply(len)
print(df)

  company_code date_of_sale  sale_amount  sale_amount_length
0         Abcd   12/05/2002      12348.5                   7
1         EFGF   16/02/1999     233331.2                   8
2      skfsalf   25/09/1998         22.5                   4
3      sdfslew   12/02/2022    2566552.0                   9
4       safsdf   15/09/1997         23.0                   4

In [385]:
details_df

      name       city  age  name_length  cith_length
0  prithvi  hyderabad   12            7            9
1     tony   corridor   13            4            8
2    tommy    balcony   14            5            7
3   snoopy      house   15            6            5
4   grumpy   hospital   16            6            8
5    tiger        zoo   17            5            3

In [386]:
details_df["age_length"] = details_df["age"].map(str).apply(len)
print(details_df)

      name       city  age  name_length  cith_length  age_length
0  prithvi  hyderabad   12            7            9           2
1     tony   corridor   13            4            8           2
2    tommy    balcony   14            5            7           2
3   snoopy      house   15            6            5           2
4   grumpy   hospital   16            6            8           2
5    tiger        zoo   17            5            3           2

#  Write a Pandas program to check if a specified column starts with a specified string in a DataFrame

In [387]:
details_df

      name       city  age  name_length  cith_length  age_length
0  prithvi  hyderabad   12            7            9           2
1     tony   corridor   13            4            8           2
2    tommy    balcony   14            5            7           2
3   snoopy      house   15            6            5           2
4   grumpy   hospital   16            6            8           2
5    tiger        zoo   17            5            3           2

In [388]:
details_df["starts_with_to"] = list(map(lambda x : x.startswith("to") , details_df["name"]))
print(details_df)

      name       city  age  name_length  cith_length  age_length  starts_with_to
0  prithvi  hyderabad   12            7            9           2           False
1     tony   corridor   13            4            8           2            True
2    tommy    balcony   14            5            7           2            True
3   snoopy      house   15            6            5           2           False
4   grumpy   hospital   16            6            8           2           False
5    tiger        zoo   17            5            3           2           False

In [389]:
details_df["ends_with_y"] = list(map(lambda x : x.endswith("y") , details_df["name"]))
print(details_df)

      name       city  age  name_length  cith_length  age_length  starts_with_to  ends_with_y
0  prithvi  hyderabad   12            7            9           2           False        False
1     tony   corridor   13            4            8           2            True         True
2    tommy    balcony   14            5            7           2            True         True
3   snoopy      house   15            6            5           2           False         True
4   grumpy   hospital   16            6            8           2           False         True
5    tiger        zoo   17            5            3           2           False        False

# Write a Pandas program to swap the cases of a specified character column in a given DataFrame

In [390]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print(df)

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [391]:
df["swap_company_code"] = list(map(lambda x : x.swapcase() , df["company_code"]))
print(df)

  company_code date_of_sale  sale_amount swap_company_code
0         Abcd   12/05/2002      12348.5              aBCD
1         EFGF   16/02/1999     233331.2              efgf
2      zefsalf   25/09/1998         22.5           ZEFSALF
3      sdfslew   12/02/2022    2566552.0           SDFSLEW
4      zekfsdf   15/09/1997         23.0           ZEKFSDF

In [392]:
df["swap_company_code_reverse"] = list(map(lambda x : x.swapcase() , df["swap_company_code"]))
print(df)

  company_code date_of_sale  sale_amount swap_company_code swap_company_code_reverse
0         Abcd   12/05/2002      12348.5              aBCD                      Abcd
1         EFGF   16/02/1999     233331.2              efgf                      EFGF
2      zefsalf   25/09/1998         22.5           ZEFSALF                   zefsalf
3      sdfslew   12/02/2022    2566552.0           SDFSLEW                   sdfslew
4      zekfsdf   15/09/1997         23.0           ZEKFSDF                   zekfsdf

# Write a Pandas program to convert a specified character column in upper/lower cases in a given DataFrame

In [393]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print(df)

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0

In [394]:
df["upper_company_code"] = list(map(lambda x : x.upper() , df["company_code"]))
print(df)

  company_code date_of_sale  sale_amount upper_company_code
0         Abcd   12/05/2002      12348.5               ABCD
1         EFGF   16/02/1999     233331.2               EFGF
2      zefsalf   25/09/1998         22.5            ZEFSALF
3      sdfslew   12/02/2022    2566552.0            SDFSLEW
4      zekfsdf   15/09/1997         23.0            ZEKFSDF

In [395]:
df["lower_company_code"] = list(map(lambda x : x.lower() , df["company_code"]))
print(df)

  company_code date_of_sale  sale_amount upper_company_code lower_company_code
0         Abcd   12/05/2002      12348.5               ABCD               abcd
1         EFGF   16/02/1999     233331.2               EFGF               efgf
2      zefsalf   25/09/1998         22.5            ZEFSALF            zefsalf
3      sdfslew   12/02/2022    2566552.0            SDFSLEW            sdfslew
4      zekfsdf   15/09/1997         23.0            ZEKFSDF            zekfsdf

#  Write a Pandas program to convert a specified character column in title case in a given DataFrame

In [396]:
dfdf = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print(df)

  company_code date_of_sale  sale_amount upper_company_code lower_company_code
0         Abcd   12/05/2002      12348.5               ABCD               abcd
1         EFGF   16/02/1999     233331.2               EFGF               efgf
2      zefsalf   25/09/1998         22.5            ZEFSALF            zefsalf
3      sdfslew   12/02/2022    2566552.0            SDFSLEW            sdfslew
4      zekfsdf   15/09/1997         23.0            ZEKFSDF            zekfsdf

In [397]:
df["company_code_title"] = list(map(lambda x : x.title() , df["company_code"]))
print(df)

  company_code date_of_sale  sale_amount upper_company_code lower_company_code company_code_title
0         Abcd   12/05/2002      12348.5               ABCD               abcd               Abcd
1         EFGF   16/02/1999     233331.2               EFGF               efgf               Efgf
2      zefsalf   25/09/1998         22.5            ZEFSALF            zefsalf            Zefsalf
3      sdfslew   12/02/2022    2566552.0            SDFSLEW            sdfslew            Sdfslew
4      zekfsdf   15/09/1997         23.0            ZEKFSDF            zekfsdf            Zekfsdf

#  Write a Pandas program to replace arbitrary values with other values in a given DataFrame

In [398]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print(df)

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

In [399]:
df = df.replace("A","C")

In [400]:
df

  company_code date_of_sale  sale_amount
0            C   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            C   15/09/1997         23.0

# Write a Pandas program to replace more than one value with other values in a given DataFrame

In [401]:
df = df.replace(["C","B"],["A","D"])
print(df)

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            D   16/02/1999     233331.2
2            A   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

# Write a Pandas program to split a string of a column of a given DataFrame into multiple columns

In [402]:
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)

                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0

In [403]:
df[["first","middle","last"]] = df["name"].str.split(" ",expand=True)
print(df)

                 name date_of_birth    age    first middle     last
0     Alberto  Franco     17/05/2002  18.5  Alberto          Franco
1    Gino Ann Mcneill     16/02/1999  21.2     Gino    Ann  Mcneill
2        Ryan  Parkes     25/09/1998  22.5     Ryan          Parkes
3  Eesha Artur Hinton     11/05/2002  22.0    Eesha  Artur   Hinton
4       Syed  Wharton     15/09/1997  23.0     Syed         Wharton

#  Write a Pandas program to extract email from a specified column of string type of a given DataFrame

In [404]:
import re as re
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })
print("Original DataFrame:")
print(df)
def find_email(text):
    email = re.findall(r'[\w\.-]+@[\w\.-]+',str(text))
    return ",".join(email)
df['email']=df['name_email'].apply(lambda x: find_email(x))
print("\Extracting email from dataframe columns:")
print(df)

Original DataFrame:
                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com
\Extracting email from dataframe columns:
                    name_email          email
0  Alberto Franco af@gmail.com   af@gmail.com
1    Gino Mcneill gm@yahoo.com   gm@yahoo.com
2        Ryan Parkes rp@abc.io      rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com  gm@github.com

# Pandas Joining and merging DataFrame:

# Write a Pandas program to join the two given dataframes along rows and assign all data.

In [405]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

In [406]:
student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [407]:
student = pd.concat([student_data1,student_data2])
print(student)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [408]:
result_data = pd.concat([student_data1, student_data2], axis = 1)

In [409]:
result_data

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

# Write a Pandas program to append rows to an existing DataFrame and display the combined data.

In [410]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})
print(student_data1)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [411]:
s6 = pd.Series(["s6","kane williamson",220],index=["student_id","name","marks"])

In [412]:
s6

student_id                 s6
name          kane williamson
marks                     220
dtype: object

In [413]:
student_data1_combines = student_data1.append(s6,ignore_index=True)
print(student_data1_combines)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         s6   kane williamson    220

In [414]:
s7 = pd.Series(["s7","john cena",np.nan],index=["student_id","name","marks"])
print(s7)

student_id           s7
name          john cena
marks               NaN
dtype: object

In [415]:
s8 = pd.Series(["s8","randy ortan",150],index=["student_id","name","marks"])
print(s8)

student_id             s8
name          randy ortan
marks                 150
dtype: object

In [416]:
student_data1_combines = student_data1_combines.append([s7,s8],ignore_index=True)

In [417]:
student_data1_combines

  student_id              name  marks
0         S1  Danniella Fenton  200.0
1         S2      Ryder Storey  210.0
2         S3      Bryce Jensen  190.0
3         S4         Ed Bernal  222.0
4         S5       Kwame Morin  199.0
5         s6   kane williamson  220.0
6         s7         john cena    NaN
7         s8       randy ortan  150.0

# Write a Pandas program to append a list of dictioneries or series to a existing DataFrame and display the combined data

In [418]:
student_data1_combines

  student_id              name  marks
0         S1  Danniella Fenton  200.0
1         S2      Ryder Storey  210.0
2         S3      Bryce Jensen  190.0
3         S4         Ed Bernal  222.0
4         S5       Kwame Morin  199.0
5         s6   kane williamson  220.0
6         s7         john cena    NaN
7         s8       randy ortan  150.0

In [419]:
dict11 =[ {"student_id" : "s9" , "name" : "undertaket" , "marks" : 223},
       {"student_id" : "s10" , "name" : "big show" , "marks" : 221}]
print(dict11)

[{'student_id': 's9', 'name': 'undertaket', 'marks': 223}, {'student_id': 's10', 'name': 'big show', 'marks': 221}]

In [420]:
student_data1_combines = student_data1_combines.append(dict11)

In [421]:
student_data1_combines

  student_id              name  marks
0         S1  Danniella Fenton  200.0
1         S2      Ryder Storey  210.0
2         S3      Bryce Jensen  190.0
3         S4         Ed Bernal  222.0
4         S5       Kwame Morin  199.0
5         s6   kane williamson  220.0
6         s7         john cena    NaN
7         s8       randy ortan  150.0
0         s9        undertaket  223.0
1        s10          big show  221.0

In [422]:
student_data1_combines.isnull().sum()

student_id    0
name          0
marks         1
dtype: int64

In [423]:
student_data1_combines.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 1
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  10 non-null     object
 1   name        10 non-null     object
 2   marks       9 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

# Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id

In [424]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

print("Original DataFrames:")
print(student_data1)
print(student_data2)
print(exam_data)

print("\nJoin first two said dataframes along rows:")
result_data = pd.concat([student_data1, student_data2])
print(result_data)

print("\nNow join the said result_data and df_exam_data along student_id:")
final_merged_data = pd.merge(result_data, exam_data, on='student_id')
print(final_merged_data)

Original DataFrames:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

Join first two said dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Now join the said result_data and df_exam_data along student_id:
  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

# Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [425]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [426]:
final = pd.merge(student_data1,student_data2,how="inner",on="student_id")
print(final)

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

# Write a Pandas program to join the two dataframes with matching records from both sides where available

In [427]:
print(student_data1)
print(student_data2)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [428]:
outer_join = pd.merge(student_data1,student_data2,how="outer",on="student_id")
print(outer_join)

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton    200.0               NaN      NaN
1         S2      Ryder Storey    210.0               NaN      NaN
2         S3      Bryce Jensen    190.0               NaN      NaN
3         S4         Ed Bernal    222.0  Scarlette Fisher    201.0
4         S5       Kwame Morin    199.0  Carla Williamson    200.0
5         S6               NaN      NaN       Dante Morse    198.0
6         S7               NaN      NaN    Kaiser William    219.0
7         S8               NaN      NaN   Madeeha Preston    201.0

# Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [429]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print("Original DataFrames:")
print(data1)
print("--------------------")
print(data2)
print("\nMerged Data (keys from data1):")
merged_data = pd.merge(data1, data2, how='left', on=['key1', 'key2'])
print(merged_data)
print("\nMerged Data (keys from data2):")
merged_data = pd.merge(data2, data1, how='left', on=['key1', 'key2'])
print(merged_data)

Original DataFrames:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
--------------------
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

Merged Data (keys from data1):
  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

Merged Data (keys from data2):
  key1 key2   R   S    P    Q
0   K0   K0  R0  S0   P0   Q0
1   K1   K0  R1  S1   P2   Q2
2   K1   K0  R2  S2   P2   Q2
3   K2   K0  R3  S3  NaN  NaN

# Write a Pandas program to join two dataframes using keys from right dataframe only

In [430]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print("Original DataFrames:")
print(data1)
print("--------------------")
print(data2)
print("\nMerged Data (keys from data2):")
merged_data = pd.merge(data1, data2, how='right', on=['key1', 'key2'])
print(merged_data)
print("\nMerged Data (keys from data1):")
merged_data = pd.merge(data2, data1, how='right', on=['key1', 'key2'])
print(merged_data)

Original DataFrames:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
--------------------
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

Merged Data (keys from data2):
  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

Merged Data (keys from data1):
  key1 key2    R    S   P   Q
0   K0   K0   R0   S0  P0  Q0
1   K0   K1  NaN  NaN  P1  Q1
2   K1   K0   R1   S1  P2  Q2
3   K1   K0   R2   S2  P2  Q2
4   K2   K1  NaN  NaN  P3  Q3

# Write a Pandas program to merge two given datasets using multiple join keys

In [431]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print("Original DataFrames:")
print(data1)
print("--------------------")
print(data2)
print("\nMerged Data:")
merged_data = pd.merge(data1, data2, on=['key1', 'key2'])
print(merged_data)

Original DataFrames:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
--------------------
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

Merged Data:
  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

# Pandas Time Series

# Write a Pandas program to create

In [432]:
import datetime
from datetime import datetime
print("Datetime object for Jan 11 2012:")
print(datetime(2012, 1, 11))
print("\nSpecific date and time of 9:20 pm") 
print(datetime(2011, 1, 11, 21, 20))
print("\nLocal date and time:")
print(datetime.now())
print("\nA date without time: ")
print(datetime.date(datetime(2012, 5, 22)))
print("\nCurrent date:")
print(datetime.now().date())
print("\nTime from a datetime:")
print(datetime.time(datetime(2012, 12, 15, 18, 12)))
print("\nCurrent local time:") 
print(datetime.now().time())

Datetime object for Jan 11 2012:
2012-01-11 00:00:00

Specific date and time of 9:20 pm
2011-01-11 21:20:00

Local date and time:
2021-06-16 16:39:05.232765

A date without time:
2012-05-22

Current date:
2021-06-16

Time from a datetime:
18:12:00

Current local time:
16:39:05.232765

In [433]:
import datetime

In [434]:
from datetime import datetime

In [436]:
datetime(2011,1,11)

datetime.datetime(2011, 1, 11, 0, 0)

In [437]:
datetime(2012,3,12,2,22)

datetime.datetime(2012, 3, 12, 2, 22)

In [438]:
datetime.now()

datetime.datetime(2021, 6, 16, 16, 42, 19, 143592)

In [442]:
datetime.now().date()

datetime.date(2021, 6, 16)

In [443]:
datetime.now().time()

datetime.time(16, 43, 55, 959188)

In [444]:
#import pandas as pd
#from datetime import datetime
print("\nA specific date using timestamp:")
print(pd.Timestamp('2016-11-10'))
print("\nDate and time using timestamp:")
print(pd.Timestamp('2012-05-03 11:30'))
print("\nA time adds in the current local date using timestamp:")
print(pd.Timestamp('11:30'))
print("\nCurrent date and time using timestamp:")
print(pd.Timestamp("now"))

A specific date using timestamp:
2016-11-10 00:00:00

Date and time using timestamp:
2012-05-03 11:30:00

A time adds in the current local date using timestamp:
2021-06-16 11:30:00

Current date and time using timestamp:
2021-06-16 16:45:05.276523

In [445]:
tt = pd.Timestamp("now")

In [446]:
tt

Timestamp('2021-06-16 16:53:56.253385')

#  Write a Pandas program to create a date from a given year, month, day and another date from a given string formats.

In [449]:
date = datetime(year=2021,month=2,day=2)
print(date)

2021-02-02 00:00:00

In [455]:
from dateutil import parser
date2 = parser.parser("1st january , 2021")
print(date2)

<dateutil.parser._parser.parser object at 0x0000018D086E6B20>

In [456]:
from datetime import datetime
date1 = datetime(year=2020, month=12, day=25)
print("Date from a given year, month, day:")
print(date1)
from dateutil import parser
date2 = parser.parse("1st of January, 2021")
print("\nDate from a given string formats:")
print(date2)

Date from a given year, month, day:
2020-12-25 00:00:00

Date from a given string formats:
2021-01-01 00:00:00

# Write a Pandas program to print the day after and before a specified date. Also print the days between two given dates.

In [457]:
import pandas as pd
import datetime
from datetime import datetime, date
today = datetime(2012, 10, 30)
print("Current date:", today)
tomorrow = today + pd.Timedelta(days=1)
print("Tomorrow:", tomorrow)
yesterday = today - pd.Timedelta(days=1)
print("Yesterday:", yesterday)
date1 = datetime(2016, 8, 2)
date2 = datetime(2016, 7, 19)
print("\nDifference between two dates: ",(date1 - date2))

Current date: 2012-10-30 00:00:00
Tomorrow: 2012-10-31 00:00:00
Yesterday: 2012-10-29 00:00:00

Difference between two dates:  14 days, 0:00:00